---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetParametersManager
source: html/276727c8-b3fc-d31c-a7f9-bac1871a20b1.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetParametersManager Method

Returns an object used to manage parameters of the Rebar Container.

## Syntax (C#)
```csharp
public RebarContainerParameterManager GetParametersManager()
```

## Returns
The parameters manager.